bootcamp-research/_bryce/W9D2/solutions/art_share_solution/app/controllers/comments_controller.rb

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2019-04-11 19:05:37.967452"], ["updated_at", "2019-04-11 19:05:37.967452"]]
---
  def like
    like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')
    if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 2], ["likeable_id", 1], ["likeable_type", "Comment"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]
---
  def unlike
    like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')
    if like.destroy