CURIOSITY/bootcamp-research/_bryce/W8D2/url_shortener/URLShortener/app/models/shortened_url.rb

    def self.random_code
        #returns a 22 char long string
       code = SecureRandom.urlsafe_base64(16)
       while ShortenedUrl.exists?(:short_url => code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "Wygmi35i5sq95yBbiIdzPg"], ["LIMIT", 1]]

    def self.create!(user,long_url)
        surl = ShortenedUrl.new
        surl.user_id = user.id
        surl.long_url = long_url
        surl.short_url = ShortenedUrl.random_code
        surl.save!
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "Wygmi35i5sq95yBbiIdzPg"], ["long_url", "www.reddit.com"], ["user_id", 1], ["created_at", "2019-04-02 23:04:43.109568"], ["updated_at", "2019-04-02 23:04:43.109568"]]