CURIOSITY/bootcamp-research/_bryce/W9D5/music_app/app/views/albums/show.html.erb

<h5>Tracks</h5>
<% if @album.tracks.empty? %>
---
SELECT  1 AS one FROM "tracks" WHERE "tracks"."album_id" = $1 LIMIT $2  [["album_id", 1], ["LIMIT", 1]]