bootcamp-research/_bryce/aA-homeworks/W10D1/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 4], ["title", "aaaaaaaa"], ["year", 1], ["live", true], ["created_at", "2019-04-12 22:34:24.506234"], ["updated_at", "2019-04-12 22:34:24.506234"]]

  def show
    @album = Album.includes(:band).find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]

  def update
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]