{
  "data": {
    "markdownRemark": {
      "html": "<h3>Threat model</h3>\n<p>What is the context of security that I'm facing, the application is facing, the user is facing?</p>\n<ol>\n<li>\n<p>Who are your adversaries - who do you trust and who do you not trust?</p>\n<ul>\n<li>You have to trust whatever cloud service(s) you're using</li>\n</ul>\n</li>\n<li>Attack surface - what is exposed? What's most vulnerable to attack? What live services are you running, what ports do they have open, what are they doing?</li>\n<li>Attack vector - how can things be attacked? How do you take data in, how do you authenticate users?</li>\n</ol>\n<p>Thinking about adversaries, attack surface, and attack vector is how you build your threat model.</p>\n<h2>Common risks facing a user (Three categories):</h2>\n<h3>Confidentiality/Privacy:</h3>\n<p>Making sure that your information is only shown to the parties you want it to be shown to.</p>\n<h3>Integrity/Authenticity:</h3>\n<p>Having the data or information be shown and given to others or received in an unaltered fashion.</p>\n<h3>Availability:</h3>\n<p>Having the service be up and work/respond/have data (not losing data). Availability attacks are often forms of extortion.</p>\n<h3>Ransomware:</h3>\n<p>Takes over your computer, takes your data, encrypts it so you can't get at it, and extorts you for it.</p>\n<h3>Man in the Middle Attack:</h3>\n<p>Person intercepting communications between two people and at the very least listening in (violating confidentiality). Could change what one sends to the other, violating integrity/authenticity.</p>\n<h3>Denial of Service (Distributed Denial of Service/DDOS):</h3>\n<p>Attacker has control of a botnet (group of compromised computers). No particular pattern to IP addresses, so can't mitigate DDOS easily. Content distribution networks help mitigate and scale DDOS attacks.</p>\n<h3>Malware/Backdoors:</h3>\n<p>How you end up joining a botnet. Pretty much anyone with a computer is a target for these. There are also high value targets. As a developer, you're a mid-value target because if you can be compromised and they can use that compromise of you to further attack users of your applications.</p>\n<h2>Code Injection:</h2>\n<p>Class of exploits.\nDon't blindly trust user input.</p>\n<h3>Cross-site scripting:</h3>\n<p>By putting user modified code on the webpage, they might be able to embed Javascript from their other place and use it to grab cookies, etc.</p>\n<h2>Buffer overflows</h2>\n<p>If your program allows the user to potentially make something (a variable) that grows outside of the space you perscribe for it because you don't make specific guards for it, they could put code in that ends up in your C program and executing.</p>\n<h2>Rootkits</h2>\n<p>How you end up in a botnet. This is what you get installed on your computer when you click that bad email, etc.</p>\n<h1>Defenses Against Attacks:</h1>\n<p>Setting good passwords</p>\n<ul>\n<li>Don't think about them as passwords, think of them as pass phrases</li>\n<li>One word, even if you mess with it, isn't hard for a computer to guess</li>\n<li>If you pick a pass phrase and even if every word in the phrase is a common word stuck together, it's difficult for a computer to crack</li>\n<li>Important to be random (your favorite quote is guessable)</li>\n</ul>\n<h2>Firewalls:</h2>\n<p>Not as cool as on TV, but still important.\nHaving the same policy for what services you have open to be implemented - what services and ports you allow requests to come in on and what you don't.</p>\n<h2>Sanitizing input:</h2>\n<p>If it comes from a user, don't trust it.\nIf possible, the code you run if you're interacting with a database should be prepared statements or something that is guaranteed to be safe on the database. Users will still do things that will affect what you put in the database, but they shouldn't be giving you anything that will affect the actual interaction with the database.</p>\n<h2>Isolation and Permissions:</h2>\n<p>Use containers and the Content Security Policy.</p>\n<p>The Content Security Policy allows you to specify what resources are allowed to interact or be loaded on your webpage. It's a way to mitigate cross-site scripting.</p>\n<p>Containers are like lightweight virtual machines that let you isolate different processes so they don't know about each other.</p>\n<p>Maybe something still gets attacked, but it knows less.</p>\n<h2>Encryption:</h2>\n<p>Important to encrypt your data.\nCan give confidentiality and integrity.\nShould be encrypted at REST (where it's saved in your database) and also encrypted in transit (going from Point A to Point B)</p>\n<h2>Defense in Depth:</h2>\n<p>Practice where you do all of the above.\nIdea is you want to prevent attacks in as many levels and ways you can because they're going to happen and when they happen, you want to limit their damage.</p>\n<p>There will be flaws in your defenses, but if you have another layer of defense below that, you might still be okay.</p>\n<h1>XOR:</h1>\n<p>Exclusive or.\nOnly true when it's strictly A or B\nThe way a lot of people view 'or' when they're using the word 'or'.</p>\n<h2>What makes XOR so important?</h2>\n<p>Powers one-time pads.</p>\n<p>Basically, the idea behind cryptography in general: Good cryptography comes down to good randomness.</p>\n<p>In principle, and has been done in practice for centuries, if two groups or people want to communicate securely and both have a shared secret beforehand they can agree on (same copy of a book word for word), they can use that as data to XOR with their message.</p>\n<p>If you guarantee that only these two people know the key, this sort of communication has perfect security.</p>\n<p>Pad has to be as long or longer than the message you're encrypting and you can't reuse the pad.</p>\n<p>If you're using the same pad, it's vulnerable to the Man in the Middle attack.\n31:33</p>\n<h1>Cryptography</h1>\n<h2>XOR Cipher</h2>\n<p>Example of using XOR:</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-javascript line-numbers\"><code class=\"language-javascript\">message <span class=\"token operator\">=</span> <span class=\"token string\">'foo'</span>\n\npad <span class=\"token operator\">=</span> <span class=\"token string\">'bar'</span>\n\ncipher <span class=\"token operator\">=</span> <span class=\"token punctuation\">[</span><span class=\"token function\">ord</span><span class=\"token punctuation\">(</span>a<span class=\"token punctuation\">)</span> <span class=\"token operator\">^</span> <span class=\"token function\">ord</span><span class=\"token punctuation\">(</span>b<span class=\"token punctuation\">)</span> <span class=\"token keyword\">for</span> a<span class=\"token punctuation\">,</span> b<span class=\"token punctuation\">,</span> <span class=\"token keyword\">in</span> <span class=\"token function\">zip</span><span class=\"token punctuation\">(</span>message<span class=\"token punctuation\">,</span> pad<span class=\"token punctuation\">)</span><span class=\"token punctuation\">]</span>\n\ncipher\n<span class=\"token punctuation\">[</span><span class=\"token number\">4</span><span class=\"token punctuation\">,</span> <span class=\"token number\">14</span><span class=\"token punctuation\">,</span> <span class=\"token number\">29</span><span class=\"token punctuation\">]</span>\n\nciphertext <span class=\"token operator\">=</span> <span class=\"token string\">''</span><span class=\"token punctuation\">.</span><span class=\"token function\">join</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">[</span><span class=\"token function\">chr</span><span class=\"token punctuation\">(</span>c<span class=\"token punctuation\">)</span> <span class=\"token keyword\">for</span> c <span class=\"token keyword\">in</span> cipher<span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span>\n\nciphertext\n<span class=\"token string\">'\\x04\\x0e\\x1d'</span>\n\ndecrypted <span class=\"token operator\">=</span> <span class=\"token punctuation\">[</span><span class=\"token function\">ord</span><span class=\"token punctuation\">(</span>a<span class=\"token punctuation\">)</span> <span class=\"token operator\">^</span> <span class=\"token function\">ord</span><span class=\"token punctuation\">(</span>b<span class=\"token punctuation\">)</span> <span class=\"token keyword\">for</span> a<span class=\"token punctuation\">,</span> b <span class=\"token keyword\">in</span> <span class=\"token function\">zip</span><span class=\"token punctuation\">(</span>ciphertext<span class=\"token punctuation\">,</span> pad<span class=\"token punctuation\">)</span><span class=\"token punctuation\">]</span>\n\ndecrypted\n<span class=\"token punctuation\">[</span><span class=\"token number\">102</span><span class=\"token punctuation\">,</span> <span class=\"token number\">111</span><span class=\"token punctuation\">,</span> <span class=\"token number\">111</span><span class=\"token punctuation\">]</span>\n\nplaintext <span class=\"token operator\">=</span> <span class=\"token string\">''</span><span class=\"token punctuation\">.</span><span class=\"token function\">join</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">[</span><span class=\"token function\">chr</span><span class=\"token punctuation\">(</span>c<span class=\"token punctuation\">)</span> <span class=\"token keyword\">for</span> c <span class=\"token keyword\">in</span> decrypted<span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span>\n\nplaintext\n<span class=\"token string\">'foo'</span></code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></pre></div>\n<p>The way cryptography works in general is not a lot different than this.</p>\n<h2>How does encryption work?</h2>\n<p>We exchange keys and these keys are used as seeds for random number generators. A random number generator takes a little bit of something like a key and expands it into a lot more of psuedo-randomness that's supposed to still behave a lot like real randomness but was generated by this algorithm.</p>\n<p>After that, it's not just XOR, but XOR is at the heart of a lot of encryption. The secret and the quality of the encryption comes down to the quality of the randomness and it's like a one time pad.</p>\n<h2>Basic operations:</h2>\n<h3>Hash functions:</h3>\n<p>Take input and output a digest that looks like gobbledygook.\nThe idea is that it should be a one-way function.\nA lot of package managers provide a hash to confirm that what they send and what you receive are the same.</p>\n<h3>Signing</h3>\n<p>If you take the data you want to sign and then encrypt using your private key and attach it to the data as a certificate, the person who receives the signed data (the data plus the encrypted version of the hash) can take your public key and decrypt it. They independently calculate using the same hash function their version of the hash of the data and they see if the version they get from your signature equals that and then they know that the data is what you said it was and that you're who you say you are.</p>\n<h3>Encrypting</h3>\n<p>If you generate a key and you have a secret message and then you generate a nonce and click encrypt, you get ciphertext.</p>\n<h3>Verifying</h3>\n<h3>Decrypting</h3>\n<p>If somebody else pastes in the ciphertext, key, and nonce, and decrypt, they get the secret message.</p>\n<p>Key stays the same and both members of the exchange have the key.\nNonces are used once. You change them every time to make it harder for an attacker to track patterns and figure out what the secret key is.</p>\n<h2>Symmetric Cryptography:</h2>\n<p>Both parties have the same key</p>\n<h2>Asymmetric Cryptopgraphy:</h2>\n<p>Whenever you generate a secret key, you also generate a public key.\nGenerates ciphertext and a nonce, sends them to someone else\nEveryone needs to know the public key of the other participant</p>\n<h3>Public key infrastructure</h3>\n<p>How your OS and browser knows what to trust and what not to.\nCertificate authorities are trusted to keep secure keys and use their secure keys to sign the keys they give to other people.\nBrowsers and operating systems then put a list of the certificate authorities they trust into their products.</p>\n<p>No end-user setup. If you trust your vendor, pretty secure.\nDownside is centralization - if one certificate authority gets hacked, can be really bad.</p>\n<h3>Web of Trust:</h3>\n<p>Idealized model for tools like GPG (open-source version of PGP - pretty good privacy). People make their own keypairs and manage their own keypairs, go to key signing parties and sign keys for their friends to verify keys come from their friends, etc.</p>\n<p>If you trust your friend's keys and you see them signing other keys, you trust those keys, etc.</p>\n<h3>Keybase:</h3>\n<p>Tries to make key management and key signing parties more manageable. You post your proof that verifies you hold a public key on your social media</p>\n<h1>What do you need to know about cryptography as a developer?</h1>\n<ol>\n<li>\n<p>How to pick the right protocols, tools, parameters\nComplicated. Good start is <a href=\"http://www.daemonology.net/blog/2009-06-11-cryptographic-right-answers.html\">http://www.daemonology.net/blog/2009-06-11-cryptographic-right-answers.html</a>\nDon't need to understand or read all of it - a little outdated, but it's a good start</p>\n<p>TweetNaCl is a good tool that makes a lot of decisions for you.</p>\n<p>NIST provides recommendations for how long you should make your keys: <a href=\"https://www.keylength.com/en/4/\">https://www.keylength.com/en/4/</a></p>\n<p>Don't build your own crypto unless you specialize and go into that area. Established crypto code is well-established</p>\n</li>\n<li>\n<p>Use OAuth integrated log-ins (OAuth2):\nOpen standard for authorization and logging in\nAllows you to provide the login framework and rely on companies like Google, Facebook, Twitter, Amazon, Apple, etc. to maintain user accounts and handle password resets, etc.\nWhen you can use it, it's good to.</p>\n</li>\n<li>\n<p>Personal security is important - keep your own secret safe.\nTurn on encryption on your local system\nUse pass phrases not passwords\nUse backups, encrypt them</p>\n</li>\n<li>\n<p>Use SSL\nIt's free and easy (Let's Encrypt)\nThere are packages that integrate with pretty much all frameworks and languages\nTrusted in browsers\nUse SSL for all production systems\nProduction could mean internal systems that are on the open internet as well as something that users use</p>\n</li>\n<li>\n<p>Public-private key pairs to log into things\nMuch better than pass phrases because it's longer than any pass phrase you're going to remember</p>\n</li>\n<li>\n<p>Two Factor/multi-factor authentication\nGold standard is thing you know (pass phrase), thing you have (phone/fob), thing you are (fingerprint, face, etc.)\nNot really any common things that support all things\nDamage of losing your pass phrase is lessened when you have multiple methods of authentication</p>\n</li>\n<li>\n<p>Don't reuse the same passphrase for everything\nHave a few very good passphrases and use a password manager to maintain very long random passwords for everything else</p>\n</li>\n<li>\n<p>Check signatures when installing software</p>\n</li>\n</ol>\n<h2>Future of Software Security:</h2>\n<p>Cryptocurrency built off the same cryptographic primitives - hash functions.\nGoal is different - not just two people passing messages, you're trying to create a decentralized global and usually public transaction ledger that's a list of numbers and time stamps. This list is something everyone knows and agrees on but no group owns it and can change it.</p>\n<p>Why does this matter?\nMoney, the entirety of finance, is basically a list of transactions.\nTo dencentralize that means we don't have to trust and pay for banks to be these entities that manage this and instead it's out there and people use it.</p>\n<p>Lots of things you can represent as a ledger of transactions:\nTickets\nNews stories\nCommunication</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">Public aspect of the ledger means you probably want to encrypt communication on it.</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span></span></pre></div>\n<h2>Newer cryptocurrencies:</h2>\n<h3>Etherium</h3>\n<ul>\n<li>More sophisticated scripting than bitcoin - can program logic into the things on the blockchain to create contracts enforced by conditional logic.</li>\n<li>Can be guaranteed that the agreement will be enforced but without having to trust a third party</li>\n</ul>\n<h3>Proof of Work:</h3>\n<p>Most blockchains use that to provide an incentive for miners to actually run the code to make the crypto work and be trustworthy.</p>\n<h2>Quantum Cryptography:</h2>\n<h3>The impact of quantum computation on regular cryptography.</h3>\n<p>If and when quantum computing gets powerful enough and big enough to work at a large enough scale to do things to attack the sides of cryptographic problems, hash functions are no longer so one-way.</p>\n<p>Not true for every hash function.</p>\n<p>Post-quantum cryptography - trying to figure out what hash functions and schemes will survive a post-quantum world and what won't.</p>\n<p>Even when it comes, will be held by large organizations at first but the rest of us will want cryptography that still works.</p>",
      "frontmatter": {
        "date": "2018-07-30",
        "title": "Lambda School: Introduction to Security & Cryptography",
        "chapter": null,
        "subtitle": null,
        "tags": ["security", "cryptography"],
        "path": "/Intro-to-Security-and-Cryptography"
      }
    }
  },
  "pageContext": {
    "isCreatedByStatefulCreatePages": false,
    "pathSlug": "/Intro-to-Security-and-Cryptography",
    "prev": {
      "frontmatter": {
        "path": "/CS5-Graphs-I",
        "title": "CS5: Graphs I",
        "tags": ["CS5", "graphs"],
        "subtitle": null,
        "chapter": null
      }
    },
    "next": {
      "frontmatter": {
        "path": "/Regex",
        "title": "Regex",
        "tags": ["regex", "theory of computation"],
        "subtitle": null,
        "chapter": null
      }
    }
  }
}
