{
  "data": {
    "markdownRemark": {
      "html": "<h3>Drivers</h3>\n<p>Special programs the OS runs that can talk to hardware that know the rules for specific hardware devices.</p>\n<p>Need an operating system, or you would have to write every computer program starting with CPU language.</p>\n<p>Operating systems began to emerge in the 50s/60s.</p>\n<p>Multi-user system that can run multiple programs at once.</p>\n<p>Operating system is the brains of your computer.</p>\n<p>Microsoft Windows:\nBill Gates and friends made a pretty well-executed copy of an operating system that was hard to get and understand and sold it to everybody.</p>\n<p>Two variants of PC operating systems that you'll see in people's hands:</p>\n<p>There's a third operating system that is of great, great importance, called iOS that is not Windows or Linux.</p>\n<p>If you're using a Mac for development, it's not Linux, but it's POSIX.</p>\n<p>Reason Windows has slipped in popularity:\nIt was designed stupidly in the beginning (feature):\nEasy to use and quick</p>\n<p>Few principled technologies that OS provide:</p>\n<h2>Process scheduling -</h2>\n<p>OS is the reason your system can run multiple programs at the same time.</p>\n<p>\"The Process Scheduler\" swaps each program out on a schedule.</p>\n<h2>BIOS - program that launches when your computer boots up:</h2>\n<ul>\n<li>Firmware programs that aren't stored in your memory - stored on the motherboard and chips themselves</li>\n<li>Knows how to talk to your harddisk</li>\n<li>Knows how to talk to your graphics display</li>\n<li>Knows how to talk to your network card</li>\n<li>Reads the first sector on the harddisk (master boot record), which is the beginning of where your OS is</li>\n<li>Reads the first block of memory from your OS and loads it</li>\n<li>Will eventually find launchd</li>\n</ul>\n<p>The youngest process ID is the oldest living system - the one that has to run everything else.</p>\n<p>Two of the lowest level systems in the OS</p>\n<ul>\n<li>Can talk to the hardware</li>\n<li>Can do everything</li>\n</ul>\n<h3>Launch daemon's jobs:</h3>\n<ul>\n<li>Load new programs</li>\n<li>Run them</li>\n<li>Make them time-share\n(Because only one CPU and only one program can be run at a time)</li>\n</ul>\n<h3>User agent:</h3>\n<ul>\n<li>Controls what programs can be run</li>\n<li>Which memory the programs can access</li>\n<li>Enforces the rules of the system</li>\n</ul>\n<p>Windows did not have a permissions model at all in the 80s/90s - loaded files into memory with no problem.</p>\n<p>If you want to be a Windows programmer:</p>\n<ul>\n<li>You can make video games but it's thankless work with lots of hours and not much money.</li>\n<li>You can make medical tracking software for doctors.</li>\n<li>You can work for Microsoft themselves.</li>\n<li>You can work for the government.</li>\n<li>There's a lot of need for security, so always jobs for security</li>\n</ul>\n<p>Worst thing about developing for Windows: when you want to write a new program, you have to give it compatability mode commands that go through all the other versions of Windows. So just building a basic program in Windows involves referencing the Windows 98, NT, ME, etc. sourcebases and configuring it to work in all those environments separately.</p>\n<p>Compared to the Apple technique -> just to break your computer (there being a point where technology no longer works on older machines).</p>\n<p>Linux based on UNIX -> ran on mainframes, faxes, building-sized systems, and was developed by academics in a closed environment to do everything an operating system should.</p>\n<ul>\n<li>A tree of files\nFiles are able to communicate with processes using streams of text data</li>\n</ul>\n<p>Programs can communicate with each other through files and streams of data side to side.</p>\n<p>Windows communication is done mostly through the registry (a catastrophe).</p>\n<p>C programming language is all about configuring your program before it gets compiled so it works on the plaform that you're trying to build it for.</p>\n<p>If you don't have the same system, you do meta programming, build configuration, and you don't program in C until you work out the gimicks.</p>\n<p>For doing cross platform C development, 80% of the work is platform compatability and 20% is writing the thing you want to share with people.</p>\n<p>Question: Will we be doing things you can't do in Visual Studio?</p>\n<p>Yes.</p>\n<p>Biggest challenge of trying to use Visual Studio on Windows is that the system calls 'do not intersect' with the Linux system calls.</p>\n<p>For 20 years, Windows has been trying to copy Linux's system calls.</p>\n<p>Example, sockets didn't exist in Windows and they made a copy of BSD sockets called winsock that was marginally well implemented and has been the bane of tens of thousands of developers in that you can't write a program in C that talks to the Windows operating system and the Linux operating system.</p>\n<p>You can meta program, you can manipulate the program so it writes a different program on Windows vs Ubuntu but will not write the same program.</p>\n<p>Question: How does not building the hardware with the software affect Windows vs OSX?</p>\n<p>It affects the quality of the experience.</p>\n<p>Windows builds the operating system and then tells vendors (people who build hardware) how their hardware needs to work in order to work on Windows.\nAnd then Windows has a multi-billion dollar certification lab for testing the hardware that people want to sell to make it Windows certified.\nBecause it's a free market, you don't have to get your Windows stuff certified.\nYou can make your driver, etc and release it to the public and sell it and it might work or might not work.</p>\n<h1>Technology of your Operating System is all software</h1>\n<p>C Software\nAssembly language\nBinary wire commands</p>\n<h2>What C is:</h2>\n<p>A high level programming langauge that converts human thought structures into assembly langauge.</p>\n<h2>Assembly langauge:</h2>\n<p>The human representation of wire commands that go to the CPU</p>\n<p>Below the assembly language it turns into the machine code that does go to the CPU</p>\n<h2>When you boot the computer:</h2>\n<p>CPU does bit flipping\nBIOS finds the harddrive, loads the master boot record from the harddrive</p>\n<ul>\n<li>That points to a file that is CPU executable instructions that will load everything else until the computer is up and running</li>\n<li>That file eventually runs a program called the kernel</li>\n</ul>\n<h3>Kernel</h3>\n<ul>\n<li>This file has very efficient algorithms for scheduling processes, loads them, schedules them, and keeps them safe from each other - doesn't allow them to delete each other's memory. Doesn't allow them to overwrite or cancel another program</li>\n<li>Provides commands for processes to talk to each other\nProvides a file management system called a file table and algorithms that contorl the creation of files, the discovery of files, and drivers.</li>\n<li>Runs specially privileged programs that are CPU level instructions out to new peripherals</li>\n</ul>\n<p>When you run OSX, there's a block of drivers. Many written by Apple to control the harddrive, wifi, touchpad, etc.<br>\nEach driver is a C program that knows the precise language of a specific piece of hardware.\nWhen that driver program gets loaded by the kernel, it enables the CPU to handshake with that hardware and receive input/output from it</p>\n<p>On Windows:\nPackage with 50,000 or 100,000 drivers, etc. 700 drivers for NVIDIA video cards. Drivers essentially become another program that the OS schedules.</p>\n<h1>Processes, Scheduling, Memory Management, File System</h1>\n<h2>The function of the kernel:</h2>\n<p>Execute processes and schedule them\nManage their memory and the rest of the memory in the system\nProvide access to and execute drivers that can control hardware\nCreate a file system for addressing long term storage and loading files such as drivers and executable processes from them.</p>\n<p>Kernel is the core of the computer - alpha program</p>\n<p>Kernel keeps a proces list inside of it.\nIt runs a closed loop:\nMost basic operating technique in any computer is a loop that says while true.</p>\n<p>Any long-lived program that you write tends to be inside of a while loop. Any program where the input and output are undefined and could be anything at any time.</p>\n<p>That's what the kernel does.</p>\n<p>Probably, it has a setup block before the while loop.</p>\n<p>During setup, load the disk drivers so we can read the disk.\nThen, create a memory map of all the memory in the system (what's available and what's been assigned to who).\nLoad the process scheduler program.\nLoad the memory manager\nLoad the user agent\nLoad the file table</p>\n<p>Put the memory addresses for the memory management program into the list of the entire memory in the sytem - do that for user agent, file table, etc.</p>\n<p>While true, load the next program</p>\n<p>There's a list containing all of the processes that have been loaded.</p>\n<p>Inside of the while loop, the OS comes online and says now that the basic systems have set up, execute them in turn</p>\n<p>From the process list, pop the currently executed item.<br>\nAnd it's probably not going to keep it as an stack, it'll have an array and a pointer at the index</p>\n<p>Going to load at the index and execute it.</p>\n<p>From the beginning:\nBOOT -> Power on Self Test (POST)->BIOS-> MBR\n-> Initial kernel</p>\n<p>Operating system kernel-> kernel system processes->\nload programs for:</p>\n<ul>\n<li>Process scheduling</li>\n<li>Memory management</li>\n<li>File table</li>\n<li>Drivers</li>\n</ul>\n<h2>POST:</h2>\n<p>Firmware programs that check memory is present, there's a long-term storage available, and graphics are available</p>\n<h2>BIOS:</h2>\n<p>Launches operating system from the boot record</p>\n<h2>MSR</h2>\n<p>Master Boot Record</p>\n<h3>Kernel system commands:</h3>\n<p>Read a file\nWrite a file\nAllocate memory for a process\nDestroy memory\nWrite data to a driver\nCreate a new process\nKill processes</p>\n<p>[https://imgur.com/a/l3uLfiL]</p>",
      "frontmatter": {
        "date": "2018-08-12",
        "title": "Operating Systems",
        "chapter": null,
        "subtitle": null,
        "tags": ["operating systems"],
        "path": "/Operating-Systems"
      }
    }
  },
  "pageContext": {
    "isCreatedByStatefulCreatePages": false,
    "pathSlug": "/Operating-Systems",
    "prev": {
      "frontmatter": {
        "path": "/CS8-Operating-Systems-I",
        "title": "CS8: Operating Systems I",
        "tags": ["CS8", "operating systems"],
        "subtitle": null,
        "chapter": null
      }
    },
    "next": {
      "frontmatter": {
        "path": "/Binary-Conversion",
        "title": "Binary Conversion",
        "tags": ["binary conversion"],
        "subtitle": null,
        "chapter": null
      }
    }
  }
}
