{
  "data": {
    "markdownRemark": {
      "html": "<h2>Operating Systems:</h2>\n<ul>\n<li>interface with hardware so that the rest of your computer can access the hardware through the abstraction that the OS provides.</li>\n<li>handles scheduling and processes/process abstraction</li>\n<li>memory management</li>\n<li>etc...</li>\n</ul>\n<h2>Scheduling:</h2>\n<p>What is the ordering/prioritizing on what processes get execution time on a CPU</p>\n<p>Network card on your machine is what sends off the data packets:</p>\n<ul>\n<li>Writing code that interfaces with the abstraction the OS provides for the network card</li>\n</ul>\n<h2>Web Servers:</h2>\n<ul>\n<li>Working with the primary abstraction the OS provides to interface with the network card/hardware (socket)</li>\n</ul>\n<p>Should be able to:</p>\n<ul>\n<li>open up a terminal</li>\n<li>curl to your server once you start it</li>\n<li>open up a browser that will access that port and make a request to your server from the browser and get the response back from the server when it's running</li>\n</ul>\n<h2>Network Protocols:</h2>\n<ul>\n<li>Stack of layers: - Ethernet (layer that sits right above the networking hardware) - IP header that implements the internet protocol - The TCP header that deals with data integrity and ensures the data is in a certain format that can be sent - HTTP (deals with the web data) - Body (what gets served up)\n(Don't need to memorize that.)</li>\n</ul>\n<h3>Protocols:</h3>\n<h4>UDP:</h4>\n<ul>\n<li>Faster than TCP.</li>\n<li>Doesn't do the verification (doesn't care that the data is sent, doesn't wait before sending the next piece of data)</li>\n<li>Streaming video/multiplayer gaming are some use cases</li>\n<li>When you're doing multiplayer gaming, there's no time for that verification step and if a little bit gets lost, it's not a big deal</li>\n</ul>\n<h4>TCP:</h4>\n<ul>\n<li>Verifies (when you use TCP Protocol to send data, the sender will wait for a response from the recipient back to acknowledge they received the data )</li>\n<li>Data integrity</li>\n<li>Whenever you make a request from your browser, it goes through the TCP protocols</li>\n</ul>\n<p>Can you do the error checking client-side?</p>\n<ul>\n<li>If you were to do that with the protocol, the server would have to take more time out of its flow to resend the data - that would hurt the performance aspect of it.</li>\n<li>With UDP, if some data gets lost, we just don't care</li>\n</ul>\n<p>File transfers would use TCP, not UDP because it's sent in one chunk.</p>\n<p>If you care about getting the whole file versus dropping bits, I'm curious if client side checking plus UDP would be an improvement over TCP:\nNot sure if UDP can accomodate verification, so you'd have to finagle that so it would be able to receive a response.</p>\n<h4>IP Layer:</h4>\n<ul>\n<li>What deals with the routing</li>\n<li>Deals with the actual routing and the protocol that knows how to take your data that you want to send to an address and get it there through the network that is the internet</li>\n</ul>\n<h4>Ethernet protocol:</h4>\n<ul>\n<li>Sits on top of network card and interfaces with the hardware</li>\n</ul>\n<p>In order to work with this networking in code, need abstraction of socket.</p>\n<h3>Similar to when we did piping:</h3>\n<ul>\n<li>With piping, we created read and write ends of a pipe and we wrote data to one end and it came out the other end.</li>\n<li>In many ways, that's similar to a socket, it's just that sockets have additional overhead on top of pipes because they have to deal with the protocol stuff, so they're more optimized for working with that in particular.</li>\n</ul>\n<h3>In Mac and Linux:</h3>\n<ul>\n<li>Socket API, which is is baked into your C runtime supports UDP and TCP as well as IPv4 and IPv6 internet protocols.</li>\n<li>Sockets provide additional functionality in order to make better sense of that</li>\n<li>For the most part, very similar to pipes</li>\n</ul>\n<p>Server will receive requests</p>\n<ul>\n<li>Request is of a given format (HTTP header)</li>\n<li>Server needs to figure out what endpoint the user is trying to access and send the appropriate response in resposne to that request</li>\n<li>Need to adhere to format closely because otherwise the browser won't be able to process it</li>\n<li>Content length is the amount of bytes in HTML response</li>\n<li>Content type is going to be html/text</li>\n</ul>\n<h3>Endpoints on server:</h3>\n<p>/ - root - <h1>Hello, World</h1>\n/d20 - returns a random number between 1 and 20 inclusive as text/plain data.\n/date - prints the current date and time in GMT as text/plain data</p>\n<p>More an exercise in reading a bunch of code than implementing a bunch of code</p>\n<ul>\n<li>Practice being dropped into a codebase where there's already a bunch of stuff in place and having to change the software without breaking anything else</li>\n<li>Biggest C codebase you've worked with unless you worked in C outside Lambda</li>\n<li>Most C code you'll have seen in one file</li>\n<li>Most of the networking stack has been implemented for you</li>\n<li>What you'll be doing will be parsing the responses and sending out the appropriate responses in turn</li>\n<li>The stuff that has to do with receiving the responses and sending them back out has pretty much already been implemented</li>\n</ul>\n<h3>Most important thing:</h3>\n<ul>\n<li>Read as much as you can, both the code and the comments, and try to make enough sense of it that you know what you need to implment, how to do it, and where it should go (IMPLEMENT ME)</li>\n<li>On an actual job, you won't have those IMPLEMENT ME comments, nor would the empty code declarations, and the code wouldn't be nearly as commented (unless you're really lucky)</li>\n<li>Lean on comments (i.e., \"This is only necessary if we've implemented a multiprocessed version using fork()\" - only need for stretch goal)</li>\n</ul>",
      "frontmatter": {
        "date": "2018-08-12",
        "title": "CS8: Operating Systems I",
        "chapter": null,
        "subtitle": null,
        "tags": ["CS8", "operating systems"],
        "path": "/CS8-Operating-Systems-I"
      }
    }
  },
  "pageContext": {
    "isCreatedByStatefulCreatePages": false,
    "pathSlug": "/CS8-Operating-Systems-I",
    "prev": {
      "frontmatter": {
        "path": "/State-Machines",
        "title": "State Machines",
        "tags": ["state machines", "theory of computation"],
        "subtitle": null,
        "chapter": null
      }
    },
    "next": {
      "frontmatter": {
        "path": "/Operating-Systems",
        "title": "Operating Systems",
        "tags": ["operating systems"],
        "subtitle": null,
        "chapter": null
      }
    }
  }
}
