CURIOSITY/bootcamp-research/_bryce/W10D4/reddit/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("post_id", "parent_comment_id", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["post_id", 6], ["parent_comment_id", 1], ["content", "what?"], ["author_id", 2], ["created_at", "2019-04-18 22:55:26.024294"], ["updated_at", "2019-04-18 22:55:26.024294"]]