CURIOSITY/bootcamp-research/_bryce/W10D4/reddit/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "cool food things"], ["updated_at", "2019-04-18 20:02:01.127315"], ["id", 1]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub.moderator_id == current_user.id && @sub.update(sub_params)