bootcamp-research/_bryce/aA-homeworks/W10D1/music_app/app/views/albums/new.html.erb

        <select name="album[band_id]" id="album_band">
            <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"