{
  "data": {
    "markdownRemark": {
      "html": "<h1>Technical Interviews</h1>\n<br/>\n<h2>Steps</h2>\n<br/>\n<h3>Listen Carefully</h3>\n<ul>\n<li>Understand the problem</li>\n<li>Ask clarifying questions</li>\n<li>Keep track of <em>unique</em> information in the problem - things that may hint toward an approach/solution (e.g., sorted vs. unsorted, if the algorithm will be run repeatedly or have a one-time use)</li>\n<li>Write down these unique pieces of information</li>\n</ul>\n<h3>Draw an Example</h3>\n<ul>\n<li>Make sure it's long enough to be representative of the problem you're trying to solve</li>\n<li>Make sure the example isn't a special case - for example, a perfect binary tree in a binary tree problem</li>\n<li>Use actual data as input to your example, such as numbers or strings</li>\n</ul>\n<h3>State Brute Force</h3>\n<ul>\n<li>Talk about how you'd go about solving the problem using a brute force approach</li>\n<li>Accept that this solution is going to be terrible and inefficient</li>\n<li>Explain the space and time complexity of that solution</li>\n<li>Don't code yet!</li>\n</ul>\n<h3>Optimize</h3>\n<ul>\n<li>Look for unused information (things the interviewer told you about the problem that you haven't integrated into your solution)</li>\n<li>Use a new example - seeing a new example sometimes jars your memory or allows you to see a pattern that wasn't apparent with a single example</li>\n<li>Solve incorrectly - this might put you on the path to the right solution </li>\n<li>Make space and time tradeoffs</li>\n<li>Precompute -> can you reorganize the information in the problem or solve for parts of the problem earlier that will speed up runtime?</li>\n<li>Use a hash table</li>\n<li>Think about best conceivable runtime</li>\n</ul>\n<h3>Walk Through</h3>\n<ul>\n<li>When you've come up with an optimal solution, don't jump in to coding too quickly</li>\n<li>Walk through the algorithm to get a feel for the structure, the variables necessarhy to make it work, what elements change, etc.</li>\n<li>You can pseudocode during this step, but if your pseudocode starts looking like sloppily written code, you might be better off just writing real code</li>\n<li><strong>IMPORTANT</strong>: If you don't understand what you're about to write, you will struggle to code it, it will take you longer, and it will be more likely to contain errors.</li>\n</ul>\n<h3>Implement</h3>\n<ul>\n<li>Actually start writing your code</li>\n<li>Start from top left of the whiteboard in order to give you space to write</li>\n<li>Be careful not to slant your writing (taking up valuable space)</li>\n<li>Write functions as though they exist -> refer to helper functions that haven't been created yet</li>\n<li>Error check -> add a todo and explain what you'd like to test (but not right now)</li>\n<li>Name variables so it's easy to tell what they are</li>\n<li>If you see something that you want to refactor, make a note of it to your interviewer but move on, coming back to it if time allows</li>\n</ul>\n<h3>Test</h3>\n<ul>\n<li><strong>Test conceptually</strong> - walk through the solution line by line and explain what it's doing, checking to see if it does what you think it does</li>\n<li><strong>Check for weirdness</strong> - if you see something that doesn't make sense (like using array.length - 2), check to make sure that you had a reason for writing that</li>\n<li><strong>Hot spots</strong> -> bugs that often show up in code (integer division, base cases on recurison, null nodes in binary trees, etc)</li>\n<li><strong>Small test cases</strong> - use 3-4 elements</li>\n<li><strong>Special cases</strong> -> THE RETURN OF THE PERFECT BINARY TREE!</li>\n<li><strong>If you find bugs</strong> - before you start writing code to try to kill the bug, first understand what circumstances allowed it to exist in order to better understand how to kill it</li>\n</ul>\n<h2>Optimize &#x26; Solve: Technique #1: Look for BUD</h2>\n<p><strong>B</strong>ottlenecks</p>\n<p><strong>U</strong>nnecessary work</p>\n<p><strong>D</strong>uplicated work</p>\n<h3>Bottlenecks</h3>\n<p>Bottlenecks usually occur in two ways:</p>\n<ul>\n<li>One-time work that slows down the algorithm (for example, sorting an array)</li>\n<li>A piece of code that is run multiple times (i.e., when searching)</li>\n</ul>\n<h4>Example:</h4>\n<p><strong>Prompt</strong></p>\n<p>Given an array of distinct integer values, count the number of pairs of integers that have a difference of <em>k</em></p>\n<p><strong>Input</strong></p>\n<p>array = [1, 7, 5, 9, 2, 12, 3]\nk = 2</p>\n<p><strong>Expected output</strong></p>\n<p>4 ([1, 3], [3, 5], [5, 7], [7, 9])</p>\n<p>Brute force approach would be to iterate through the array.  For every index, search for a number that is <em>k</em> offset from the value of the current index.</p>\n<ul>\n<li>Bottleneck to this approach is the search</li>\n</ul>\n<p>If we sort the array first, we could find the match for the value at the given index using a binary search.</p>\n<ul>\n<li>Bottleneck to this appraoch is the sorting</li>\n</ul>\n<p>Optimal solution, then, would be to use a hash table - add values of the array to a hash table and iterate through the array checking if <em>value<em>of</em>current_index + k</em> or <em>value<em>of</em>current_index - k</em> has already been added to the hash table.</p>\n<h3>Unnecessary Work</h3>\n<h4>Example</h4>\n<p><strong>Prompt</strong></p>\n<p>Print all the possible solutions to the equation a<sup>3</sup> + b<sup>3</sup> = c<sup>3</sup> + d<sup>3</sup> where a, b, c, and d are integers between 1 and 1000</p>\n<p><strong>Brute force</strong></p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">n = 1000\nfor a from 1 to n\n    for b from 1 to n\n        for c from 1 to n\n            for d from 1 to n\n                if a^3 + b^3 = c^3 + d^3\n                    print a, b, c, d</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></pre></div>\n<p>The runtime complexity of this approach is O(N)<sup>4</sup></p>\n<p>By the time we get to the for loop for d, we know there's only one valid value for d, so we can just do math to figure it out rather than iterating through 1000 possibilities because d = the cube root of a<sup>3</sup> + b<sup>3</sup> - c<sup>3</sup></p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">...\n    d = pow(a^3 + b^3 - c^3, 1/3) // will round to int\n    if a^3 + b^3 = c^3 + d^3 // validate it works\n        print a, b, c, d</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span></span></pre></div>\n<p>This reduces runtime complexity to O(N)<sup>3</sup></p>\n<h3>Duplicated Work</h3>\n<p>Working with the same problem from unnecessary work:</p>\n<p>You could create a list of (c, d) pairs once and when there's an (a, b) pair, find the matches within the (c, d) list.  We can locate these easily if we store them in a hash table with the sum as the key.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">n = 1000\nfor c from 1 to n\n    for d from 1 to n\n        result = c^3 + d^3\n        append (c, d) to list at value map[result]\nfor a from 1 to n\n    for b from 1 to n\n        result = a^3 + b^3\n        list = map.get(result)\n        for each pair in list\n            print a, b, pair</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></pre></div>\n<p>One better: Map all of (c, d) pairs will be the same as (a, b) pairs, so we can use the map directly rather than re-computing the pairs!</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">n = 1000\nfor c from 1 to n\n    for d from 1 to n\n        result = c^3 + d^3\n        append(c, d) to list at value map[result]\nfor each result, list in map\n    for each pair1 in list\n        for each pair2 in list\n            print pair1, pair2</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></pre></div>\n<p>Now the runtime complexity is O(N<sup>2</sup>)</p>\n<h2>Optimize &#x26; Solve: Technique #2: DIY</h2>\n<p>When given a problem, try working it through intuitively on a real example.  Bigger examples usually are easier.  Think about how you solved it and try to reverse-engineer your solution.  Make a note of any mental jumps you took in the solving of the problem, such as ignoring values based on a given critera.</p>\n<h2>Optimize &#x26; Solve: Technique #3: Simplify &#x26; Generalize</h2>\n<p>Take a problem, remove or modify a constraint to see how to solve a simpler version of the problem.  Then try to adapt the solution to a more complex version.</p>\n<h3>Example</h3>\n<p><strong>Prompt</strong></p>\n<p>A ransom note is formed by cutting words out of a magazine to form a new sentence.  How do you figure out if a ransome note can be formed from a given magazine?</p>\n<p><strong>Technique</strong></p>\n<p>To simplify, modify so you're cutting characters out of a magazine instead of whole words - you can then solve by creating an array and counting the number of characters -> each index represents one letter of the alphabet.  Count the number of times each character appears in the note, then check the magazine for those same characters.</p>\n<p>To generalize, we create a hash table of words and their frequencies.</p>\n<h2>Optimize &#x26; Solve: Technique #4: Base Case &#x26; Build</h2>\n<p>Solve the problem for the base case first (e.g., n = 1) and then build from there, trying to build more complex cases from prior solutions</p>\n<h3>Example</h3>\n<p><strong>Prompt</strong></p>\n<p>Design an algorithm to print all permutations of a string.  For simplicity, assume uniqueness</p>\n<p><strong>test input</strong></p>\n<p>abcdefg</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">case &quot;a&quot; -&gt; { &quot;a&quot; }\ncase &quot;ab&quot; -&gt; { &quot;ab&quot;, &quot;ba&quot; }\ncase &quot;abc&quot; -&gt; ???</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span></span></pre></div>\n<p>How can we generate \"abc\" from \"ab\"?</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">P(&quot;abc&quot;) = insert &quot;c&quot; into all locations of all strings in { &quot;ab&quot;, &quot;ba&quot; }\nP(&quot;abc&quot;) = merge ({ &quot;cab&quot;, &quot;acb&quot;, &quot;abc&quot; }, { &quot;abc&quot;, &quot;bca&quot;, &quot;bac&quot; })\nP(&quot;abc&quot;) = { &quot;cab&quot;, &quot;acb&quot;, &quot;abc&quot;, &quot;cba&quot;, &quot;bca&quot;, &quot;bac&quot; }</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span></span></pre></div>\n<p>Generate all permutations by chopping off the last character, generating all permutations of the string without it, iterating through thtat list, and inserting the chopped off character at every location of the string</p>\n<p>Base Case &#x26; Build algorithms often lend themselves to natural recursive algorithms</p>\n<h2>Optimize &#x26; Solve: Technique #5: Data Structure Brainstorm</h2>\n<p>It's a little hacky, but effective.  Go through a list of data structures and try to apply each one.  The problem may be trivial once you find the right data structure to approach the problem with.</p>\n<h3>Example:</h3>\n<p><strong>Prompt</strong></p>\n<p>Numbers are randomly generated and stored in an expanding array - how do you keep track of the median?</p>\n<p><strong>Thought process</strong></p>\n<ul>\n<li><em>Linked list</em> - Probably not, since it's not generally useful for accessing and sorting</li>\n<li><em>Array</em> - Maybe, but we have one already - could we keep it sorted?</li>\n<li><em>Binary tree</em> - Maybe a good option.  Binary trees are good at maintaining order.  But the median wouldn't always be at the root of the tree (since lists with an even number of items would require taking an average of the middle two elements)</li>\n<li><em>Heap</em> - Really good at ordering and keeping track of the minimum and maximum.  If you had a min heap containing the larger half of the elements and a max heap containing the smaller half, the middle element would be at the root.  If the heaps aren't the same size, you can pop an element off one heap and put it onto the other</li>\n</ul>\n<h2>Best Conceivable Runtime</h2>\n<p>Best runtime you can imagine a solution to a problem having.  This is based on inputs and outpus and has no particular connectiont to a specific algorithm.</p>\n<ul>\n<li>BCR is not necessarily achievable - just guarantees that you can't do better than that estimate</li>\n</ul>\n<h2>Handling Incorrect Answers</h2>\n<h3><strong>MYTH</strong> Candidates need to get every question right.</h3>\n<ul>\n<li>Responses are complicated and there are many factors that go into the assessing of them - code readability, how optimal the solution was, how long it took to arrive at that solution, how much coaching was needed, etc.</li>\n<li>Performance is evaluated comparatively to other candidates</li>\n<li>Many questions are difficult and shoudln't be expected to be solved quickly</li>\n</ul>\n<h2>When You've Heard a Question Before</h2>\n<p>Admit this to your interviwer.  They're trying to gauge your problem solving and they can't do that if you already know how to solve the problem.</p>\n<ul>\n<li>Some people find it dishonest if you don't tell them that you've seen the question before</li>\n</ul>\n<h2>\"Perfect\" Language for Interviewing</h2>\n<ul>\n<li>Use a language that is widely used so that it's more likely that your interviewer knows it</li>\n<li>Some languages are more easily read than others and this should be taken into consideration</li>\n<li>Some languages introduce more complexity and room for error than others - such as needing to handle memory allocation and deallocation </li>\n<li>Some langauges are more verbose and may therefore take longer to write solutions in</li>\n<li>Some languages are easier to use</li>\n</ul>\n<p>Ultimately, it's up to you and you should code in the language you're most comfortable coding in.</p>\n<h2>Writing Good Code: What Makes It Good</h2>\n<h3>Correct</h3>\n<p>The solution works on expected and unexpected inputs</p>\n<h3>Efficient</h3>\n<p>Operates with good space and time complexity.  Be mindful of constants that don't matter in Big O but may matter in an application</p>\n<h3>Readable</h3>\n<p>Another developer should be able to read your code and understand what it's doing.  You should comment your code where necessary.  Implementation should be understandable.</p>\n<h3>Maintainable</h3>\n<p>Code should be able to adapt to change</p>\n<h2>Use Data Structures Generously</h2>\n<h3>Example</h3>\n<p><strong>Prompt</strong></p>\n<p>Write a function to add two simple mathematical expressions in the form <em>Ax<sup>a</sup> + Bx<sup>b</sup> + ...</em> (coefficients and exponents can be any positive or negative real number) without employing the use of string parsing.  Use whatever data structure you want to hold the expressions.</p>\n<h4>Bad implementation</h4>\n<p>Storing the expression as an array of doubles where <em>kth</em> element corresponds with coefficient of the <em>x<sup>k</sup></em> term in the expression.</p>\n<p><strong>Why it's bad</strong></p>\n<p>Does not support negative or non-integer exponents.  Requires an array of the length of the largest exponent.</p>\n<h4>Less Bad</h4>\n<p>Store expression as 2 arrays - coefficients and exponents</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">double [] coef1, double[] exp1, double[] coef2, double[] exp2</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span></span></pre></div>\n<p>This approach doesn't have the same restriction the previous one did as the index is no longer directly tied to any meaning for the values in the array.  However, it's still a bit messy and complicated because you need to keep track of two arrays for a single expression.</p>\n<h4>Good</h4>\n<p>Create your own data structure!</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">struct ExprTerm {\n    double coefficient;\n    double exponent;\n}</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span></span></pre></div>\n<p>Now you can have an array of an expression rather than separate arrays.</p>\n<h2>Code Reuse</h2>\n<p>If you need to do something with different input that gets manipulated the same way (i.e., converting numbers from binary as well as converting numbers from hexadecimal), build a function that can handle different instances</p>\n<h2>Modular</h2>\n<p>Break functions apart!</p>\n<h2>Flexibility</h2>\n<p>Allow for more general input when possible rather than the expected input.  <strong>UNLESS GENERALIZING WILL ADD SIGNIFICANT COMPLEXITY</strong></p>\n<h2>Error Checking</h2>\n<p>It's good practice to validate input through the use of assert and if statements.  If error checking is much more than a quick if statement, it might be best to leave space where the error check would go and indicate to the interviewer that you would write them when finished</p>\n<h2>Don't Give Up</h2>\n<ul>\n<li>Keep at it even when it's difficult</li>\n<li>Bonus points if you can show enthusiasm for solving hard problems</li>\n</ul>",
      "frontmatter": {
        "date": "2019-03-15",
        "title": "Cracking the Coding Interview",
        "chapter": "Chapter 7",
        "subtitle": "Technical Interviews",
        "tags": [
          "Cracking the Coding Interview",
          "technical interviews",
          "algorithms",
          "data structures"
        ],
        "path": "/Cracking-The-Coding-Interview--Technical-Interviews"
      }
    }
  },
  "pageContext": {
    "isCreatedByStatefulCreatePages": false,
    "pathSlug": "/Cracking-The-Coding-Interview--Technical-Interviews",
    "prev": {
      "frontmatter": {
        "path": "/A-Tour-Of-Go",
        "title": "A Tour Of Go",
        "tags": ["Go"],
        "subtitle": "Basics I & II",
        "chapter": null
      }
    },
    "next": {
      "frontmatter": {
        "path": "/Big-O-Notation",
        "title": "Big O Notation",
        "tags": ["Big O Notation", "time complexity"],
        "subtitle": null,
        "chapter": null
      }
    }
  }
}
